# Zenvy Payroll SaaS - Week 1: Product & Tech Foundation

## Goal
The goal of this week is to understand the payroll domain, SaaS concepts, and set up the technical environment for data analysis.

---

## 1. Payroll Domain Research

### Payroll Basics
- **Salary**: The fixed compensation paid to an employee (Gross vs Net).
- **Deductions**: Mandatory cuts like EPF (12%), ESI, and TDS (Income Tax).
- **Overtime**: Additional pay for hours worked beyond the standard 48 hours/week.
- **Leaves**: Earned, Sick, and Casual leaves that affect monthly payroll.

### SaaS Architecture
- **Multi-tenant**: A single software instance serves multiple customers (tenants), but data is isolated.
- **Cloud-based**: Hosted on platforms like AWS or Azure for global accessibility.

### Market Competitors
- **Zoho Payroll**: Best for SMBs integrated with Zoho Books.
- **GreytHR**: Comprehensive statutory compliance for Indian companies.
- **Keka**: Modern employee-centric HRMS and Payroll platform.

## 2. Data Exploration & Cleaning

We will load the sample payroll datasets and perform basic analysis.

In [1]:
import pandas as pd

# Load datasets
employees = pd.read_csv('zenvy_employees.csv')
attendance = pd.read_csv('zenvy_attendance.csv')
payroll = pd.read_csv('zenvy_payroll.csv')

print("Datasets loaded successfully!")

Datasets loaded successfully!

## Employees

In [2]:
employees.head()

,employee_id,employee_name,department,designation,base_salary,joining_date
0,1001,Aarav,IT,Developer,50000,2023-01-31
1,1002,Diya,HR,HR Executive,35000,2023-02-28
2,1003,Rohan,Finance,Accountant,40000,2023-03-31
3,1004,Sneha,IT,Developer,55000,2023-04-30
4,1005,Karan,Sales,Sales Exec,30000,2023-05-31

In [3]:
employees.shape

(20, 6)

In [4]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   employee_id    20 non-null     int64
 1   employee_name  20 non-null     object
 2   department     20 non-null     object
 3   designation    20 non-null     object
 4   base_salary    20 non-null     int64
 5   joining_date   20 non-null     object
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [5]:
employees.isnull().sum()

employee_id      0
employee_name    0
department       0
designation      0
base_salary      0
joining_date     0
dtype: int64

In [6]:
employees.dtypes

employee_id       int64
employee_name    object
department       object
designation      object
base_salary       int64
joining_date     object
dtype: object

In [7]:
employees.describe()

       employee_id   base_salary
count     20.00000     20.000000
mean    1010.50000  53950.000000
std        5.91608  20011.772851
min     1001.00000  30000.000000
25%     1005.75000  35750.000000
50%     1010.50000  51000.000000
75%     1015.25000  71250.000000
max     1020.00000  90000.000000

## Attendance

In [8]:
attendance.head()

   employee_id  working_days  present_days  overtime_hours
0         1001            22            20               5
1         1002            22            21               2
2         1003            22            19               0
3         1004            22            22               8
4         1005            22            20               4

In [9]:
attendance.shape

(20, 4)

In [10]:
attendance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employee_id     20 non-null     int64
 1   working_days    20 non-null     int64
 2   present_days    20 non-null     int64
 3   overtime_hours  20 non-null     int64
dtypes: int64(4)
memory usage: 772.0 bytes

In [11]:
attendance.dtypes

employee_id       int64
working_days      int64
present_days      int64
overtime_hours    int64
dtype: object

In [12]:
attendance.isnull().sum()

employee_id       0
working_days      0
present_days      0
overtime_hours    0
dtype: int64

In [13]:
attendance.describe()

       employee_id  working_days  present_days  overtime_hours
count     20.00000          20.0     20.000000       20.000000
mean    1010.50000          22.0     20.600000        4.400000
std        5.91608           0.0      1.095445        3.377947
min     1001.00000          22.0     19.000000        0.000000
25%     1005.75000          22.0     20.000000        2.000000
50%     1010.50000          22.0     21.000000        4.000000
75%     1015.25000          22.0     21.250000        6.250000
max     1020.00000          22.0     22.000000       12.000000

## Payroll

In [14]:
payroll.head()

   employee_id  gross_salary  tax_deduction  pf_deduction  net_salary
0         1001         52500         5000.0        2500.0     45000.0
1         1002         36000         3500.0        1750.0     30750.0
2         1003         40000         4000.0        2000.0     34000.0
3         1004         59000         5500.0        2750.0     50750.0
4         1005         32000         3000.0        1500.0     27500.0

In [15]:
payroll.shape

(20, 5)

In [16]:
payroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   employee_id    20 non-null     int64
 1   gross_salary   20 non-null     int64
 2   tax_deduction  20 non-null     float64
 3   pf_deduction   20 non-null     float64
 4   net_salary     20 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 932.0 bytes

In [17]:
payroll.dtypes

employee_id        int64
gross_salary       int64
tax_deduction    float64
pf_deduction     float64
net_salary       float64
dtype: object

In [18]:
payroll.isnull().sum()

employee_id      0
gross_salary     0
tax_deduction    0
pf_deduction     0
net_salary       0
dtype: int64

In [19]:
payroll.describe()

       employee_id  gross_salary  tax_deduction  pf_deduction    net_salary
count     20.00000     20.000000      20.000000     20.000000     20.000000
mean    1010.50000  56150.000000    5395.000000   2697.500000  48057.500000
std        5.91608  21156.745845    2001.177285   1000.588643  18161.347584
min     1001.00000  32000.000000    3000.000000   1500.000000  27500.000000
25%     1005.75000  36375.000000    3575.000000   1787.500000  31012.500000
50%     1010.50000  54000.000000    5100.000000   2550.000000  46350.000000
75%     1015.25000  72500.000000    7125.000000   3562.500000  61812.500000
max     1020.00000  96000.000000    9000.000000   4500.000000  82500.000000

## 3. Identifying Key Metrics for Dashboards

We will calculate the specific metrics required for the Power BI dashboard.

In [20]:
# 1. Create dim_employee (Dimension Table)
dim_employee = employees[['employee_id', 'employee_name', 'department', 'designation', 'base_salary', 'joining_date']]

# 2. Create fact_transaction (Fact Table)
# Merging Attendance and Payroll for numeric analysis
fact_transaction = attendance.merge(payroll, on='employee_id')

# Merging for complete analysis view (View only)
df_complete = dim_employee.merge(fact_transaction, on='employee_id')

# 3. Salary by Department
dept_salary = df_complete.groupby('department')['gross_salary'].sum().reset_index()

# 4. Total Overtime Hours
total_ot = fact_transaction['overtime_hours'].sum()

# 5. Total Employee Cost
total_cost = fact_transaction['gross_salary'].sum()

print(f"--- Key Metrics ---\n")
print(f"Total Employee Cost: ‚Çπ{total_cost}")
print(f"Total Overtime Hours: {total_ot} hours")
display(dept_salary)

--- Key Metrics ---

Total Employee Cost: ‚Çπ1123000
Total Overtime Hours: 88 hours

  department  gross_salary
0    Finance        240500
1         HR        173000
2         IT        430500
3  Marketing        145500
4      Sales        133500

## 4. SQL Integration (MySQL Database Connection)

We will connect to your local MySQL server and "append" our cleaned data into tables. 

> **Note**: Please create a database named `zenvy_payroll_db` in your MySQL before running this cell.

In [21]:
from sqlalchemy import create_engine

In [22]:
engine = create_engine("mysql+pymysql://root:123{Password@123}@localhost:3306/zenvy_payroll_db")

In [23]:
from urllib.parse import quote_plus

password = "Password@123"
encoded_password = quote_plus(password)  

engine = create_engine(f"mysql+pymysql://root:{encoded_password}@localhost:3306/zenvy_payroll_db")

In [24]:
print("Connecting to MySQL...")

# 4. Test connection & Upload Data
try:
    # Testing the connection
    with engine.connect() as connection:
        print("‚úÖ MySQL Connected Successfully!")
        
        # Datasets-ah MySQL tables-ku load pannalaam
        print("Uploading data to tables...")
        dim_employee.to_sql('dim_employee', con=engine, if_exists='append', index=False)
        fact_transaction.to_sql('fact_transaction', con=engine, if_exists='append', index=False)
        # payroll table merged into fact_transaction
        
        print("üöÄ Star Schema data successfully uploaded to your MySQL database!")

except Exception as e:
    print(f"‚ùå Error: {e}")

Connecting to MySQL...
‚úÖ MySQL Connected Successfully!
Uploading data to tables...
üöÄ Star Schema data successfully uploaded to your MySQL database!